{
  "modelTopology": {
    "backend": "tensorflow",
    "keras_version": "2.2.2",
    "model_config": {
      "class_name": "Sequential",
      "config": [
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "batch_input_shape": [
              null,
              6
            ],
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 64,
            "use_bias": true
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "noise_shape": null,
            "rate": 0.5,
            "seed": null,
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_2",
            "trainable": true,
            "units": 64,
            "use_bias": true
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_2",
            "noise_shape": null,
            "rate": 0.5,
            "seed": null,
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "softmax",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_3",
            "trainable": true,
            "units": 3,
            "use_bias": true
          }
        }
      ]
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "loss_weights": null,
      "metrics": [
        "accuracy"
      ],
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "amsgrad": false,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "decay": 0.0,
          "epsilon": 1E-7,
          "lr": 0.0010000000474974513
        }
      },
      "sample_weight_mode": null
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1"
      ],
      "weights": [
        {
          "dtype": "float32",
          "name": "dense_1/kernel",
          "shape": [
            6,
            64
          ]
        },
        {
          "dtype": "float32",
          "name": "dense_1/bias",
          "shape": [
            64
          ]
        },
        {
          "dtype": "float32",
          "name": "dense_2/kernel",
          "shape": [
            64,
            64
          ]
        },
        {
          "dtype": "float32",
          "name": "dense_2/bias",
          "shape": [
            64
          ]
        },
        {
          "dtype": "float32",
          "name": "dense_3/kernel",
          "shape": [
            64,
            3
          ]
        },
        {
          "dtype": "float32",
          "name": "dense_3/bias",
          "shape": [
            3
          ]
        }
      ]
    }
  ]
}